k6/results/pg-benchmark-2026-03-18T13-17-21.txt
============================================================
PG Simulator Benchmark — 2026-03-18T13:17:21.673Z
============================================================

[ Scenarios ]

  payment_request:
    executor:  ramping-vus
    startVUs:  1
    stages:
      - 10s → 10 VUs
      - 20s → 10 VUs (hold)
      - 10s → 30 VUs
      - 20s → 30 VUs (hold)
      - 10s → 50 VUs
      - 20s → 50 VUs (hold)
      - 10s → 0 VUs (ramp down)

  status_check:
    executor:  constant-vus
    vus:       10
    duration:  30s
    startTime: 105s

[ Thresholds ]
    http_req_duration: p(95)<3000
    http_req_failed: rate<0.5

[ Target ]  http://localhost:8082

============================================================
     ✗ status is 200
      ↳  60% — ✓ 3998 / ✗ 2587
     ✗ has transactionKey
      ↳  60% — ✓ 3998 / ✗ 2587
     ✓ status check 200

     checks.........................: 60.95% ✓ 8076      ✗ 5174
     data_received..................: 1.7 MB 12 kB/s
     data_sent......................: 2.1 MB 16 kB/s
     http_req_blocked...............: avg=115.24µs min=1µs      med=6µs      max=5.2ms    p(90)=312µs    p(95)=363µs   
     http_req_connecting............: avg=86.61µs  min=0s       med=0s       max=5.14ms   p(90)=244µs    p(95)=280µs   
   ✓ http_req_duration..............: avg=306.49ms min=3.23ms   med=306.11ms max=518.16ms p(90)=469.02ms p(95)=487.86ms
       { expected_response:true }...: avg=307.32ms min=3.23ms   med=309.05ms max=518.16ms p(90)=469.62ms p(95)=489.03ms
   ✓ http_req_failed................: 38.95% ✓ 2653      ✗ 4158
     http_req_receiving.............: avg=99.65µs  min=6µs      med=80µs     max=6.21ms   p(90)=168µs    p(95)=212.49µs
     http_req_sending...............: avg=30.57µs  min=4µs      med=25µs     max=1.67ms   p(90)=50µs     p(95)=63µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=306.36ms min=3.11ms   med=306.04ms max=518.01ms p(90)=468.92ms p(95)=487.69ms
     http_reqs......................: 6811   49.482891/s
     iteration_duration.............: avg=448.28ms min=203.53ms med=415.1ms  max=3.01s    p(90)=578.1ms  p(95)=597.23ms
     iterations.....................: 6731   48.90168/s
     payment_fail...................: 2587   18.794926/s
     payment_success................: 3998   29.046043/s
     status_check_duration..........: avg=7.0625   min=4        med=7        max=26       p(90)=9        p(95)=9.05    
     status_pending.................: 80     0.581211/s
     vus............................: 2      min=0       max=50
     vus_max........................: 60     min=60      max=60