k6/results/ranking-benchmark-2026-04-08T11-26-47.txt
============================================================
Ranking System Benchmark — 2026-04-08T11:26:47.565Z
============================================================

[ Scenarios ]

  ranking_read_light:
    executor:  constant-vus (50 VUs, 30s)
    endpoint:  GET /api/v1/rankings?page=1&size=20
    purpose:   랭킹 페이지 조회 기본 부하

  product_detail_rank:
    executor:  constant-vus (100 VUs, 30s)
    endpoint:  GET /api/v1/products/{id}
    purpose:   상품 상세 + rank enrichment + outbox→streamer 쓰기 구동

  ranking_read_heavy:
    executor:  ramping-vus (0→200→0, 25s, starts at 35s)
    purpose:   랭킹 페이지 동시 조회 폭증

  ranking_deep_page:
    executor:  constant-vus (30 VUs, 15s, starts at 65s)
    endpoint:  GET /api/v1/rankings?page={1..5}&size=50
    purpose:   deep pagination 오버헤드

[ Thresholds ]
    http_req_failed: rate < 0.05
    ranking_page:    p(95)<500ms, p(99)<1000ms
    product_detail:  p(95)<800ms, p(99)<1500ms

[ Target ]  http://localhost:8080
[ Products ] id=1..100

============================================================
     ✓ detail: 200
     ✓ ranking_light: 200
     ✓ ranking_heavy: 200
     ✓ ranking_deep: 200

     checks.........................: 100.00% ✓ 71275      ✗ 0    
     data_received..................: 149 MB  1.9 MB/s
     data_sent......................: 6.8 MB  85 kB/s
     http_req_blocked...............: avg=38.51µs min=0s       med=1µs      max=58.3ms   p(90)=3µs      p(95)=5µs     
     http_req_connecting............: avg=34.55µs min=0s       med=0s       max=56.93ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=5.8ms   min=1.06ms   med=4.64ms   max=36.45ms  p(90)=10.3ms   p(95)=12.11ms 
       { expected_response:true }...: avg=5.8ms   min=1.06ms   med=4.64ms   max=36.45ms  p(90)=10.3ms   p(95)=12.11ms 
     ✓ { name:product_detail }......: avg=7.96ms  min=1.73ms   med=7.31ms   max=36.45ms  p(90)=12.18ms  p(95)=14.79ms 
     ✓ { name:ranking_page }........: avg=4.43ms  min=1.06ms   med=3.89ms   max=34.99ms  p(90)=6.54ms   p(95)=8.34ms  
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 71275
     http_req_receiving.............: avg=71.46µs min=4µs      med=49µs     max=4.91ms   p(90)=149µs    p(95)=200µs   
     http_req_sending...............: avg=6.98µs  min=1µs      med=4µs      max=4.19ms   p(90)=12µs     p(95)=19µs    
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=5.72ms  min=936µs    med=4.56ms   max=36.44ms  p(90)=10.25ms  p(95)=12.03ms 
     http_reqs......................: 71275   889.467266/s
     iteration_duration.............: avg=126.1ms min=101.27ms med=105.29ms max=575.92ms p(90)=114.44ms p(95)=209.24ms
     iterations.....................: 71275   889.467266/s
     product_detail_latency_ms......: avg=7.96016 min=1.732    med=7.316    max=36.455   p(90)=12.1898  p(95)=14.7909 
     product_detail_ok..............: 27742   346.202748/s
     product_detail_with_rank.......: 27742   346.202748/s
     ranking_read_latency_ms........: avg=4.43152 min=1.068    med=3.895    max=34.992   p(90)=6.54     p(95)=8.3426  
     ranking_read_ok................: 43533   543.264518/s
     read_success_rate..............: 100.00% ✓ 69085      ✗ 0    
     vus............................: 30      min=0        max=200
     vus_max........................: 350     min=350      max=350